# 1) Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 2) Importing files

In [2]:
# Path
path = r'C:\Users\GTSA - Infinity\Documents\Analytika career foundry\Task 4 PYTHON\Instacart Basket Analysis'

In [3]:
# Importing customers.csv
customers = pd.read_csv(os.path.join(path, '02 Original Data', 'customers.csv'), index_col = False)

# 3) Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis

In [4]:
customers.shape

(206209, 10)

In [5]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# There is no reason to drop any columns.

In [6]:
# Renaming columns

In [7]:
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [8]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [9]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [10]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [11]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [12]:
customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [13]:
customers.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [14]:
# Checking result
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Column names are changed.

In [15]:
# Checking data types

In [16]:
customers['user_id'].dtype

dtype('int64')

In [17]:
customers['first_name'].dtype

dtype('O')

In [18]:
customers['last_name'].dtype

dtype('O')

In [19]:
customers['gender'].dtype

dtype('O')

In [20]:
customers['state'].dtype

dtype('O')

In [21]:
customers['age'].dtype

dtype('int64')

In [22]:
customers['date_joined'].dtype

dtype('O')

In [23]:
customers['number_of_dependants'].dtype

dtype('int64')

In [24]:
customers['family_status'].dtype

dtype('O')

In [25]:
customers['income'].dtype

dtype('int64')

In [26]:
# Changing data type if needed

In [27]:
# Changing user_id to a string, non-numerical value
customers['User_ID'] = customers['user_id'].astype('str')

In [28]:
# Checking data type of user_id

In [29]:
customers['User_ID'].dtype

dtype('O')

# 4) Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [30]:
# Getting a descriptive statistics summary
customers.describe()

             user_id            age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

# Descriptive statistics: values seem to be reasonable.

In [31]:
# Checking for null/missing values
customers.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
family_status               0
income                      0
User_ID                     0
dtype: int64

# There are missing 11259 first names in the column first_name. I could leave them because there are no missing values in the column last_name.

In [32]:
# Checking for mixed type data
for col in customers.columns.tolist():
    weird=(customers[[col]].applymap(type)!=customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len(customers[weird])>0:
        print(col)

first_name

In [33]:
# Changing first_name to a string, non-numerical value
customers['first_name'] = customers['first_name'].astype('str')

In [34]:
# Checking for missing values
customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
User_ID                 0
dtype: int64

# No missing values after changing the column first_name into string.

In [35]:
# Looking for duplicates
customers_dups = customers[customers.duplicated()]

In [36]:
customers_dups.head()

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, family_status, income, User_ID]
Index: []

# There are no duplicates.

# 5) Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [37]:
# Importing order_products_merged.pkl
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Original data', 'Prepared Data', 'ords_prods_merge_4.8.pkl'))

In [38]:
# Checking the head of the ords_prods_merge to find the key column
ords_prods_merge.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_prices,Spender_type,median_days_since_prior_order,Customer_frequency
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Mid-range product,Regularly busy,Slowest days,Most orers,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Mid-range product,Least busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Mid-range product,Least busy,Regularly busy,Most orers,10,New customer,6.367797,Low_spender,20.5,Non_frequent_customer

In [39]:
# Checking head of customers.csv
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income,User_ID
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,26711
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285,33890
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568,65803
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049,125935
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374,130797

# The key column is user_id

In [40]:
# Checking data type of user_id column in  ords_prods_merge and customers.csv

In [41]:
ords_prods_merge['user_id'].dtype

dtype('int64')

In [42]:
customers['user_id'].dtype

dtype('int64')

In [43]:
# Changing both user_id to a string - non-numerical value

In [44]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [45]:
customers['user_id'] = customers['user_id'].astype('str')

In [46]:
# Checking the data type

In [47]:
ords_prods_merge['user_id'].dtype

dtype('O')

In [48]:
customers['user_id'].dtype

dtype('O')

In [49]:
# Performing the merge
ords_prods_customers_merged = customers.merge(ords_prods_merge, on = 'user_id')

In [50]:
# Checking result
ords_prods_customers_merged.head(10)

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_prices,Spender_type,median_days_since_prior_order,Customer_frequency
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Slowest days,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
5,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Average orders,8,New customer,7.988889,Low_spender,19.0,Regular_customer
6,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Average orders,8,New customer,7.988889,Low_spender,19.0,Regular_customer
7,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
8,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer
9,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Low-range product,Regularly busy,Regularly busy,Most orers,8,New customer,7.988889,Low_spender,19.0,Regular_customer

In [51]:
# Checking values
ords_prods_customers_merged['_merge'].value_counts()

both          32406041
left_only            0
right_only           0
Name: _merge, dtype: int64

In [52]:
ords_prods_customers_merged.isnull().sum()

user_id                                0
first_name                             0
last_name                              0
gender                                 0
state                                  0
age                                    0
date_joined                            0
number_of_dependants                   0
family_status                          0
income                                 0
User_ID                                0
order_id                               0
eval_set                               0
order_number                           0
order_dow                              0
order_hour_of_day                      0
days_since_prior_order           2076201
product_id                             0
add_to_cart_order                      0
reordered                              0
_merge                                 0
Unnamed: 0                             0
product_name                           0
aisle_id                               0
department_id                          0
prices                                 0
price_range_loc                        0
busiest_day                            0
busiest_days                           0
busiest_period_of_day                  0
max_order                              0
loyalty_flag                           0
mean_prices                            0
Spender_type                           0
median_days_since_prior_order          5
Customer_frequency                     5
dtype: int64

In [53]:
# Checking for duplicates
ords_prods_customers_merged_dups = ords_prods_customers_merged[ords_prods_customers_merged.duplicated()]

In [54]:
ords_prods_customers_merged_dups.head()

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, family_status, income, User_ID, order_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order, product_id, add_to_cart_order, reordered, _merge, Unnamed: 0, product_name, aisle_id, department_id, prices, price_range_loc, busiest_day, busiest_days, busiest_period_of_day, max_order, loyalty_flag, mean_prices, Spender_type, median_days_since_prior_order, Customer_frequency]
Index: []

[0 rows x 36 columns]

# There are no duplicates

#  6) Exporting df to pkl format

In [55]:
ords_prods_customers_merged.to_pickle(os.path.join(path, '02 Original data','Prepared Data', 'orders_products_customers_merged_4_9_1.pkl'))